In [4]:
import pandas as pd
deoli_weather=pd.DataFrame({
    'city':['kuchalwara','patel_nagar','kota_road'],
    'temprature':[23,45,54],
    'humidity':[80,60,78]
})
deoli_weather

          city  temprature  humidity
0   kuchalwara          23        80
1  patel_nagar          45        60
2    kota_road          54        78

In [5]:
bhilwara_weather=pd.DataFrame({
    'city':['azad_chowk','azad_nagar','pancel'],
    'temprature':[34,55,24],
    'humidity':[67,15,99]
})
bhilwara_weather

         city  temprature  humidity
0  azad_chowk          34        67
1  azad_nagar          55        15
2      pancel          24        99

In [10]:
df=pd.concat([deoli_weather,bhilwara_weather],ignore_index=True)
df

          city  temprature  humidity
0   kuchalwara          23        80
1  patel_nagar          45        60
2    kota_road          54        78
3   azad_chowk          34        67
4   azad_nagar          55        15
5       pancel          24        99

In [11]:
df=pd.concat([deoli_weather,bhilwara_weather],keys=["deoli","bhilwara"])
df

                   city  temprature  humidity
deoli    0   kuchalwara          23        80
         1  patel_nagar          45        60
         2    kota_road          54        78
bhilwara 0   azad_chowk          34        67
         1   azad_nagar          55        15
         2       pancel          24        99

In [13]:
df.loc["deoli"]

          city  temprature  humidity
0   kuchalwara          23        80
1  patel_nagar          45        60
2    kota_road          54        78

In [14]:
df.loc["bhilwara"]

         city  temprature  humidity
0  azad_chowk          34        67
1  azad_nagar          55        15
2      pancel          24        99

In [21]:
temprature=pd.DataFrame({
    "city":["kuchalwara","patel_nagar","kota_road"],
    "temp":[34,53,54]
},index=[0,1,2])
temprature

          city  temp
0   kuchalwara    34
1  patel_nagar    53
2    kota_road    54

In [18]:
wind=pd.DataFrame({
    "city":["kuchalwara","patel_nagar","kota_road"],
    "wind":[4,5,5]
})
wind

          city  wind
0   kuchalwara     4
1  patel_nagar     5
2    kota_road     5

In [22]:
pd.concat([temprature,wind],axis=1)

          city  temp         city  wind
0   kuchalwara    34   kuchalwara     4
1  patel_nagar    53  patel_nagar     5
2    kota_road    54    kota_road     5

In [25]:
s=pd.Series(["humid","dry","rain"],name="event")
s

0    humid
1      dry
2     rain
Name: event, dtype: object

In [28]:
pd.concat([temprature,s],axis=1)

          city  temp  event
0   kuchalwara    34  humid
1  patel_nagar    53    dry
2    kota_road    54   rain